var test = require('test-kit').tape()
var str = require('.')

test('utf8_to_str', function (t) {
  t.table_assert(
    [
      [ 'src',                                                        'off', 'lim',   'exp'             ],
      [ [ ],                                                          null,  null,    ''                ],
      [ [ 0x61 ],                                                     null,  null,    'a'               ],
      [ [ 0x61,0x62,0x63,0xF0,0x90,0x90,0x80 ],                       null,  null,    'abc\uD801\uDC00' ],
      [ [ 97,98,99,240,144,144,128,100,101,102,103,44,195,169 ],      null,  null,    'abc𐐀defg,é'      ],
      [ [ 103,195,174,100,100,195,177,117,112,240,144,130,131,33 ],   null,  null,    'gîddñup𐂃!'      ],
      [ [ 225,132,146,44,225,133,161,44,225,134,171,44,237,149,156 ], null,  null,    'ᄒ,ᅡ,ᆫ,한'       ],
      [ [ 34,97,98,99,34,37,10 ],                                     0,     7,       '"abc"%\n'        ],
      [ [ 34,97,98,99,34,37,10 ],                                     0,     6,       '"abc"%'          ],
      [ [ 34,97,98,99,34,37,10 ],                                     1,     5,       'abc"'            ],
      [ [ 34,97,98,99,34,37,10 ],                                     0,     0,       ''                ],
      [ [ 229,156,168,229,154,180,229,175,146,231,154,132,229,134,172,230,151,165,232,163,161 ], null, null, '在嚴寒的冬日裡' ],
    ],
    str
  )
})

test('ascii', function (t) {
  for(var i=0; i<128; i++) {
    var s = String.fromCharCode(i)
    t.equal(str([i]), s, t.desc('ascii', [[i]], s))
  }
  t.end()
})